#include <stdio.h>
#include "menu.h"

void print_menu() {
    printf("                            三子棋\n");
    const char *select[8] = {
            "        _______________________________________________\n",
            "        |                                             |\n",
            "        |        请输入编号:                          |\n",
            "        |       1.开始游戏     2.退出游戏             |\n",
            "        |                                             |\n",
            "        |                                             |\n",
            "        -----------------------------------------------\n",
            "                    请输入编号[1/2]:"
    };
    for (int i = 0; i < 8; ++i) {//打印菜单
        printf("%s", select[i]);
    }
}